package com.xyj.strokeaid.activity.score;

import java.util.ArrayList;
import java.util.List;

public class ISSCommon {
    public static List<String[]> getData(){

        List<String[]> dataList = new ArrayList<>();

        dataList.add(new String[]{
                "①头部外伤后，头痛头晕\r\n" +
                        "②颈椎损伤，无骨折",

                "①意外事故致记忆丧失\r\n"+
                        "②嗜睡、木僵、迟钝，能被语言刺激唤醒" +
                        "③昏迷＜1h>\r\n" +
                        "④单纯颅顶骨折\r\n" +
                        "⑤甲状腺挫伤\r\n" +
                        "⑥臂丛神经损伤\r\n" +
                        "⑦颈椎棘突或横突骨折或移位\r\n" +
                        "⑧颈椎轻度压缩骨折（≤20%）",

                "①昏迷1～6h\r\n" +
                        "②昏迷＜1h伴神经障碍\r\n③颅底骨折\r\n" +
                        "④粉碎、开放或凹陷性颅顶骨折、脑挫裂伤、蛛网膜下腔出血\r\n" +
                        "⑤颈动脉内膜撕裂、血栓形成\r\n" +
                        "⑥喉、咽挫伤\r\n" +
                        "⑦颈髓挫伤\r\n" +
                        "⑧颈椎或椎板、椎弓跟或关节突脱位或骨折\r\n" +
                        "⑨＞1个椎体的压缩骨折或前缘压缩＞20%",

                "①昏迷1～6h，伴神经障碍\n\n" +
                        "②昏迷6～24h\n\n" +
                        "③仅对疼痛刺激有恰当反应\n\n" +
                        "④颅骨骨折性凹陷＞2cm\n\n" +
                        "⑤脑膜破裂或组织缺失\n\n" +
                        "⑥颅内血肿≤100ml\n\n" +
                        "⑦颈髓不完全损伤\n\n" +
                        "⑧喉压轧伤\n\n" +
                        "⑨颈动脉内膜撕裂、血栓形成伴神经障碍",
                "①昏迷伴有不适当的动作\r\n" +
                        "②昏迷＞24h\n\n" +
                        "③脑干损伤\n\n" +
                        "④颅内血肿＞100ml\n\n" +
                        "⑤颈4或以下颈髓完全损伤",
                "①碾压骨折\r\n" +
                        "②脑干碾压撕裂\r\n" +
                        "③断头\r\n" +
                        "④颈3以上颈髓下轧、裂伤或完全断裂，有或无骨折"

        });
        dataList.add(new String[]{
                "①角膜擦伤\r\n" +
                        "②舌浅表裂伤\r\n" +
                        "③鼻骨或颌骨骨折△\r\n" +
                        "④牙齿折断、撕裂或脱位",

                "①颧骨、眶骨、下颌体或下颌关节突骨折\r\n" +
                        "②LeFortⅠ型骨折\r\n" +
                        "③巩膜、角膜裂伤",
                "①视神经挫伤\r\n" +
                        "②LeFortⅡ型骨折",
                "LeFort Ⅲ型骨折"
        });

        dataList.add(new String[]{
                "①肋骨骨折\r\n" +
                        "②胸椎扭伤\r\n" +
                        "③胸壁挫伤\r\n" +
                        "④胸骨挫伤",

                "①2～3根肋骨骨折\r\n" +
                        "②胸骨骨折\r\n" +
                        "③胸椎脱位、棘突或横突骨折\r\n" +
                        "④胸椎轻度压缩骨折（≤20%）",

                "①单叶肺挫伤、裂伤\r\n" +
                        "②单侧血胸或气胸\r\n" +
                        "③膈肌破裂\r\n" +
                        "④肋骨骨折≥4根\r\n" +
                        "⑤锁骨下动脉或无名动脉内膜裂伤、血栓形成\r\n" +
                        "⑥轻度吸入性损伤\r\n" +
                        "⑦胸椎脱位，椎板、椎弓根或关节突骨折\r\n" +
                        "⑧椎体压缩骨折＞1个椎骨或高度＞20%",

                "①多叶肺挫伤、裂伤\r\n" +
                        "②纵膈血肿或气肿\r\n" +
                        "③双侧血气胸\r\n" +
                        "④连枷胸\r\n" +
                        "⑤心肌挫伤\r\n" +
                        "⑥张力性气胸\r\n" +
                        "⑦血胸≥1000ml\r\n" +
                        "⑧气管撕裂\r\n" +
                        "⑨主动脉内膜撕裂\r\n" +
                        "⑩锁骨下动脉或无名动脉重度裂伤\r\n" +
                        "⑪脊髓不完全损伤综合征",

                "①重度主动脉裂伤\r\n" +
                        "②心脏裂伤\r\n" +
                        "③支气管、气管破裂\r\n" +
                        "④连枷胸、吸入烧伤需机械通气\r\n" +
                        "⑤喉、气管分离\r\n" +
                        "⑥多叶肺撕裂伤伴张力性气胸，纵膈积血、积气或血胸＞1000ml\r\n" +
                        "⑦脊髓裂伤或完全损伤",

                "①主动脉完全离断\r\n" +
                        "②胸部广泛碾压"
        });

        dataList.add(new String[]{
                "①擦伤、挫伤，浅表裂伤：阴囊、阴道、阴唇、会阴\r\n" +
                        "②腰扭伤\r\n" +
                        "③血尿",
                "①挫伤，浅表裂伤：胃、肠系膜、小肠、膀胱、输尿管、尿道\r\n" +
                        "②轻度挫伤，裂伤：胃、肝、脾、胰\r\n" +
                        "③挫伤：十二指肠、结肠\r\n" +
                        "④腰椎脱位、横突或棘突骨折\r\n" +
                        "⑤腰椎轻度压缩性（≤20%）\r\n" +
                        "⑥神经根损伤",
                "①浅表裂伤：十二指肠、结肠、直肠\r\n" +
                        "②穿孔：小肠、肠系膜、膀胱、输尿管、尿道\r\n" +
                        "③大血管中度挫伤、轻度裂伤或血腹＞1000ml的肾、肝、脾、胰\r\n" +
                        "④轻度髂动、静脉裂伤后腹膜血肿\r\n" +
                        "⑤腰椎脱位或椎板、椎弓根、关节突骨折\r\n" +
                        "⑥椎体压缩骨折＞1个椎骨或＞20%前缘高度",
                "①穿孔：胃、十二指肠、结肠、直肠\r\n" +
                        "②穿孔伴组织缺失：胃、膀胱、小肠、输尿管、尿道\r\n" +
                        "③肝裂伤（浅表性）\r\n" +
                        "④严重髂动脉或静脉裂伤\r\n" +
                        "⑤不全截瘫\r\n" +
                        "⑥胎盘剥离",
                "①重度裂伤伴组织缺失或严重污染：十二指肠、结肠、直肠\r\n" +
                        "②复杂破裂：肝、脾、肾、胰\r\n" +
                        "③完全性腰髓损伤",
                "躯干横断"
        });


        dataList.add(new String[]{

                "①挫伤：肘、肩、腕、踝\r\n" +
                        "②骨折、脱位：指、趾\r\n" +
                        "③扭伤：肩锁、肩、肘、指、腕、髋、踝、趾",
                "①骨折：肱、桡、尺、腓、胫、锁骨、肩胛、腕、掌、跟、跗、跖骨、耻骨支或骨盆单纯骨折\r\n" +
                        "②脱位：肘、手、肩、肩锁关节\r\n" +
                        "③严重肌肉、肌腱裂伤\r\n" +
                        "④内膜裂伤、轻度撕裂：腕、肱、腘动脉，腕、股、腘静脉",
                "①骨盆粉碎性骨折\r\n" +
                        "②股骨骨折\r\n" +
                        "③脱位：腕、踝、膝、髋\r\n" +
                        "④膝下和上肢断裂\r\n" +
                        "⑤膝韧带断裂\r\n" +
                        "⑥坐骨神经撕裂\r\n" +
                        "⑦内膜撕裂、轻度撕裂伤：股动脉\r\n" +
                        "⑧重度裂伤伴或不伴血栓形成：腋、腘动脉，腘、股静脉",
                "①骨盆碾压性骨折\r\n" +
                        "②膝下外伤性离断、碾压伤\r\n" +
                        "③重度撕裂伤：股动脉或肱动脉",
                "骨盆开放粉碎性骨折"
        });

        dataList.add(new String[]{
                "①檫/挫伤：面/手≤25cm身体≤50cm\r\n" +
                        "②浅表裂伤：面/手≤5cm身体≤10cm\r\n" +
                        "③一度烧伤≤100%\r\n" +
                        "④二度～三度烧伤/脱套伤＜10%体表面积",
                "①檫/挫伤：面/手＞25cm，身体＞50cm\r\n" +
                        "②裂伤：面/手＞5cm，身体＞10cm\r\n" +
                        "③二度或三度烧伤/脱套伤达10%～19%体表面积",
                "二度或三度烧伤/脱套伤达20%～29%体表面积",
                "二度或三度烧伤/脱套伤达30%～39%体表面积",
                "二度或三度烧伤/脱套伤达40%～89%体表面积",
                "二度或三度烧伤/脱套伤≥90%体表面积"
        });
        return  dataList;
    }

    public static List<String> getTitleData(){

        List<String> dataList = new ArrayList<>();
        dataList.add("头颈部");
        dataList.add("面  部");
        dataList.add("胸  部");
        dataList.add("腹  部");
        dataList.add("四  肢");
        dataList.add("体  表");
        return dataList;
    }
}
